InformationRegisters/УчетныеЗаписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>УчетныеЗаписи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>id_user</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УчетныеЗаписи/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

Функция ЗаписатьНовуюУчетнуюЗапись(Логин, ID_user, Хешпароля) Экспорт
	СтруткрураВозврата = Новый Структура("Выполнено, ТекстОшибки", Ложь, "");
	
	Попытка
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Логин = Логин;
		МенеджерЗаписи.Пароль = Хешпароля;
		МенеджерЗаписи.id_user = ID_user;
		
		СтруткрураВозврата.Выполнено = Истина;;
		Возврат СтруткрураВозврата;
	Исключение
		Ошибка = "Не удалось записать новую учётную запись."; //TODO: добавить слудебное сообщение
		ДиалогиСПользователямиСервер.ПоказатьСообщениеПользователю(Ошибка);
		
		СтруткрураВозврата.ТекстОшибки = Ошибка;
		Возврат СтруткрураВозврата;
	КонецПопытки;
КонецФункции

Функция ПолучитьУчетнуюЗапись() Экспорт
	Структура = Новый Структура("Логин, Пароль");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УчетныеЗаписи.Логин КАК Логин,
	               |	УчетныеЗаписи.Пароль КАК Пароль
	               |ИЗ
	               |	РегистрСведений.УчетныеЗаписи КАК УчетныеЗаписи";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Структура.Логин = ВыборкаДетальныеЗаписи.Логин;
			Структура.Пароль = XMLЗначение(Тип("ХранилищеЗначения"), ВыборкаДетальныеЗаписи.Пароль).Получить();
		КонецЦикла;
		Возврат Структура
	КонецЕсли;
КонецФункции

#КонецОбласти
